calculate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       24840;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       24870;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       24900;
    }
    cylinder_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       25200;
    }
    cylinder_2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       25320;
    }
    cylinder_3
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       25440;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          23400;
        startFace       25560;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1800;
        startFace       48960;
    }
)

// ************************************************************************* //
